In [1]:
import MySQLdb as m

In [3]:
pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.2.0-cp310-cp310-win_amd64.whl (199 kB)
     -------------------------------------- 199.9/199.9 kB 1.0 MB/s eta 0:00:00
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
conn = m.connect(host  = 'localhost' , database = 'library' , user = 'root' , password = 'Faraz@12345')

In [3]:
cursor  = conn.cursor()

In [4]:
cursor.execute("select * from publisher")
rows = cursor.fetchall()

In [5]:
rows

((101, 'name', 'bidar', '7411046755', 'yoyo'),
 (102, 'faraz', 'banglore', '9341751161', 'jojo'))

In [46]:
cursor.execute("show databases")
database = cursor.fetchall()

In [47]:
database

(('company',),
 ('faraz',),
 ('information_schema',),
 ('library',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',))

In [48]:
cursor.execute('select * from publisher')
row = cursor.fetchone() ## retrive the first row 
while row is not None:  ## if that row exists then 
    print(row)         ## display it
    row = cursor.fetchone()  ## gert the next row

(101, 'name', 'bidar', '7411046755', 'yoyo')
(102, 'faraz', 'banglore', '9341751161', 'jojo')

In [52]:
cursor.execute('select * from publisher')
rows = cursor.fetchall()
for row in rows:
    print(row)
print('total number of rows = ', cursor.rowcount)
##cursor.close() 
##conn.close() it is used for close the connection

(101, 'name', 'bidar', '7411046755', 'yoyo')
(102, 'faraz', 'banglore', '9341751161', 'jojo')
total number of rows =  2

In [72]:
cursor.execute('select * from publisher')
rows = cursor.fetchall()
for row in rows:
    a1=row[0]
    a2 = row[1]
    a3 = row[2]
    a4 = row[3]
    a5 = row[4]
    print("%d  %s  %s  %s  %s" % (a1,a2,a3,a4,a5))

101  name  bidar  7411046755  yoyo
102  faraz  banglore  9341751161  jojo

In [122]:
import MySQLdb as m  ### CREATING THE DATABASE USING FRONTEND

In [151]:
conn = m.connect(host = 'localhost' , user = 'root' , password = 'Faraz@12345' , database = 'mydatabase12')

In [152]:
cursor  = conn.cursor()
cursor.execute('create database if not exists mydatabase12')

1

In [153]:
cursor.execute("show databases")
database = cursor.fetchall()

In [154]:
database

(('company',),
 ('faraz',),
 ('information_schema',),
 ('library',),
 ('mydatabase',),
 ('mydatabase1',),
 ('mydatabase100',),
 ('mydatabase12',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',))

In [155]:
## CREATING TABLE USING FRONTEND
strr = '''create table employee1 (eno int primary key , ename varchar(20) , sal int);'''

In [156]:
cursor.execute(strr)

0

In [157]:
#insert into employee (eno, ename, sal)
#values (101, 'faraz', 1), (102, 'tabrez', 9), (103, 'ali', 8), (104, 'khan', 7);
#strr = '''create table employee (eno int primary key, ename varchar(20), sal int);'''
#cursor.execute(strr)

st1 = '''insert into employee1 (eno, ename, sal)
values (101, 'faraz', 1), (102, 'tabrez', 9), (103, 'ali', 8), (104, 'khan', 7);'''
cursor.execute(st1)

cursor.execute('commit')

0

In [158]:
cursor.execute('select * from employee1')
result = cursor.fetchall()

In [159]:
result

((101, 'faraz', 1), (102, 'tabrez', 9), (103, 'ali', 8), (104, 'khan', 7))

In [160]:
for i in result:
    print(i)

(101, 'faraz', 1)
(102, 'tabrez', 9)
(103, 'ali', 8)
(104, 'khan', 7)

In [165]:
strr1 = '''create table employee2 (eno1 int, ename1 varchar(30), sal int, foreign key(eno1) references employee1(eno));'''

In [166]:
cursor.execute(strr1)

0

In [174]:
ins =''' insert into employee2 (eno1,ename1,sal) values(102,'faraz',89),(103,'dhoni',99) '''
cursor.execute(ins)
conn.commit()
conn.rollback()

In [175]:
cursor.execute('select * from employee2')
result = cursor.fetchall()

In [176]:
for i in result:
    print(i)

(102, 'faraz', 89)
(103, 'dhoni', 99)
(102, 'faraz', 89)
(103, 'dhoni', 99)
(102, 'faraz', 89)
(103, 'dhoni', 99)
(102, 'faraz', 89)
(103, 'dhoni', 99)

In [177]:
result

((102, 'faraz', 89),
 (103, 'dhoni', 99),
 (102, 'faraz', 89),
 (103, 'dhoni', 99),
 (102, 'faraz', 89),
 (103, 'dhoni', 99),
 (102, 'faraz', 89),
 (103, 'dhoni', 99))

In [181]:
cursor.execute('show databases')
result = cursor.fetchall()

In [182]:
result

(('company',),
 ('faraz',),
 ('information_schema',),
 ('library',),
 ('mydatabase',),
 ('mydatabase1',),
 ('mydatabase100',),
 ('mydatabase12',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',))

In [183]:
cursor.execute('use mydatabase100')

0

In [184]:
table = '''create table datascience(sid int primary key , sname varchar(20), sfees int );'''

In [185]:
cursor.execute(table)

0

In [186]:
cursor.execute("select * from datascience")

0

In [188]:
insert ='''insert into datascience(sid,sname,sfees) values (100,'faraz',45000),(101,'muzamil',45000),(102,'amman',45000) ;''' 
try:
    ## executing the sql query using sql method
    cursor.execute(insert)
    ## save the changes to the database 
    conn.commit()
except:
    ## rollback if there is any error
    conn.rollback()

In [195]:
cursor.execute('select * from datascience')
result = cursor.fetchall()

In [196]:
for i in result:
    print(i)

(100, 'faraz', 45000)
(101, 'muzamil', 45000)
(102, 'amman', 45000)

In [11]:
table = '''create table if not exists  internship(sid int primary key , sname varchar(30) , sfees int);'''

In [12]:
cursor.execute(table)

0

In [25]:
def insert_rows(sid,sname,sfees):
    str1 = '''insert into internship(sid,sname,sfees) values(%d,%s,%d)'''
    ## defining the argument
    args = (sid,sname,sfees)
    try:
        cursor.execute(str1 % args)
        conn.commit()
    except:
        conn.rollback()

In [34]:
## ENTER THE ROWS FROM THE KEYBOARD
n = int(input('how many rows ? :'))
for i in range(n):
    x = int(input('enter the student id '))
    y = input('enter the student name:')
    z = int(input('enter the student fees'))
    insert_rows(x,y,z)
    print("----------------------------------------------")

how many rows ? :2
enter the student id 101
enter the student name:faraz
enter the student fees3500
----------------------------------------------
enter the student id 102
enter the student name:attif
enter the student fees3500
----------------------------------------------

In [40]:
cursor.execute('select * from internship')
result = cursor.fetchall()

In [41]:
result

((2, '3', 4),)